kiranbad/STM32F407/41_ExternalFlash_with_Ultrasonicc/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include <stdio.h>
#include <string.h>

#define W25Q_WRITE_ENABLE      0x06
#define W25Q_READ_STATUS_REG1  0x05
#define W25Q_READ_DATA         0x03
#define W25Q_PAGE_PROGRAM      0x02
#define W25Q_SECTOR_ERASE      0x20
#define W25Q_CHIP_ID           0x90
#define BASE_ADDRESS           0x000000

#define TRIG_PIN    GPIO_PIN_10
#define ECHO_PIN    GPIO_PIN_9
#define ECHO_PORT   GPIOB
#define TRIG_PORT   GPIOB

#define B1_Pin GPIO_PIN_0
#define B1_GPIO_Port GPIOA

/* GPIO Macros */
#define W25_CS_SELECT()   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET)
#define W25_CS_DESELECT() HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET)

void UART_Log(char* msg);
void W25_Wait_Busy(void);
void W25_Write_Enable(void);
void W25_Write_Page(uint32_t address, uint8_t *pData, uint16_t size);
void W25_Read_Data(uint32_t address, uint8_t *pBuffer, uint16_t size);
void W25_Erase_Sector(uint32_t address);
void delay_us(uint16_t us);
int get_distance(void);


/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
